{
  "activation_function": "gelu",
  "architectures": [
    "PatchTSTForPretraining"
  ],
  "attention_dropout": 0.0,
  "bias": true,
  "channel_attention": true,
  "channel_consistent_masking": false,
  "context_length": 512,
  "channel_rope": true,
  "d_model": 512,
  "distribution_output": "student_t",
  "do_mask_input": true,
  "dropout": 0.0,
  "ff_dropout": 0.0,
  "ffn_dim": 512,
  "head_dropout": 0.0,
  "huber_delta": 1.0,
  "init_std": 0.02,
  "loss": "mse",
  "mask_type": "random",
  "mask_value": 0,
  "max_wavelength": 500,
  "mode": "pretrain",
  "model_type": "patchtst",
  "norm_eps": 1e-05,
  "norm_type": "rmsnorm",
  "num_attention_heads": 8,
  "num_forecast_mask_patches": 3,
  "num_hidden_layers": 8,
  "num_input_channels": 1,
  "num_parallel_samples": 100,
  "num_poly_feats": 256,
  "num_rff": 496,
  "num_targets": 1,
  "output_range": null,
  "patch_length": 16,
  "patch_stride": 16,
  "path_dropout": 0.0,
  "poly_feat_degree": 2,
  "pooling_type": "max",
  "positional_dropout": 0.0,
  "positional_encoding_type": "sincos",
  "pre_norm": true,
  "prediction_length": 128,
  "pretrained_encoder_path": null,
  "random_mask_ratio": 0.5,
  "rff_trainable": true,
  "rope_percent": 0.75,
  "scaling": "std",
  "share_embedding": true,
  "share_projection": true,
  "torch_dtype": "float32",
  "transformers_version": "4.40.1",
  "unmasked_channel_indices": null,
  "use_cls_token": false,
  "use_dynamics_embedding": false
}
